---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolPinned
source: html/d8839f2b-4024-baf7-bf62-6a792f633097.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolPinned Property

The id of the FamilySymbol to represent a pinned boundary condition.

## Syntax (C#)
```csharp
public ElementId BoundaryConditionFamilySymbolPinned { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null